# Solutions

These are the solutions for the exercises attached to Guerilla Section #2! Please read through these carefully as all the staff will should be in regular communication with the students. Thanks!

In [1]:
#Run this cell
from datascience import *
import numpy as np
import matplotlib.pyplot as plt

<a id="ex1"></a>
## Part 1

Here's a dataset about the passengers of the Titanic - let's load it and take a look.

In [2]:
titanic = Table.read_table('titanic.csv')
titanic

PassengerId | Survived | Pclass | Name                                                | Sex    | Age  | SibSp | ParCh | Ticket           | Fare    | Cabin | Embarked
1           | 0        | 3      | Braund, Mr. Owen Harris                             | male   | 22   | 1     | 0     | A/5 21171        | 7.25    | nan   | S
2           | 1        | 1      | Cumings, Mrs. John Bradley (Florence Briggs Thayer) | female | 38   | 1     | 0     | PC 17599         | 71.2833 | C85   | C
3           | 1        | 3      | Heikkinen, Miss. Laina                              | female | 26   | 0     | 0     | STON/O2. 3101282 | 7.925   | nan   | S
4           | 1        | 1      | Futrelle, Mrs. Jacques Heath (Lily May Peel)        | female | 35   | 1     | 0     | 113803           | 53.1    | C123  | S
5           | 0        | 3      | Allen, Mr. William Henry                            | male   | 35   | 0     | 0     | 373450           | 8.05    | nan   | S
7           | 0        | 1      | McCarthy, Mr. Timothy J                             | male   | 54   | 0     | 0     | 17463            | 51.8625 | E46   | S
8           | 0        | 3      | Palsson, Master. Gosta Leonard                      | male   | 2    | 3     | 1     | 349909           | 21.075  | nan   | S
9           | 1        | 3      | Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)   | female | 27   | 0     | 2     | 347742           | 11.1333 | nan   | S
10          | 1        | 2      | Nasser, Mrs. Nicholas (Adele Achem)                 | female | 14   | 1     | 0     | 237736           | 30.0708 | nan   | C
11          | 1        | 3      | Sandstrom, Miss. Marguerite Rut                     | female | 4    | 1     | 1     | PP 9549          | 16.7    | G6    | S
... (695 rows omitted)

These column named are a little confusing.

In [3]:
#Run this cell
key = make_array('Survival', 'PClass', 'Sex', 'Age', 'SisbSp', 'ParCh', 'Ticket', 'Fare', 'Cabin', 'Embarked')
definition = make_array('Survive (0 = No, 1 = Yes)', 'Ticket Class', 'Sex', 'Age in Years', 'Number of siblings/spouses aboard', 'Number of parents/children aboard', 'Tickent Number', 'Passenger fare', 'Cabin number', 'Port of Embarkation')
table_of_keys = Table().with_columns('Key', key,
                                    'Definition', definition)
table_of_keys

Key      | Definition
Survival | Survive (0 = No, 1 = Yes)
PClass   | Ticket Class
Sex      | Sex
Age      | Age in Years
SisbSp   | Number of siblings/spouses aboard
ParCh    | Number of parents/children aboard
Ticket   | Tickent Number
Fare     | Passenger fare
Cabin    | Cabin number
Embarked | Port of Embarkation

Oftentimes, our data will come in forms that is difficult for us to decipher, or not ideal in its formatting. For instance, in this dataset, the meaning of the names of the columns are unclear. For instance, the columns Pclass, SibSp, and ParCh are all confusing columns.

We also observe that the data has some columns that may not be very useful. Suppose we wanted to remove the columns "passengerId", "ticket", and "cabin". 

#1. Let's change the titanic table for GOOD by assigning the name titanic to a changed table. GOODBYE, OLD TABLE. Reassign the name titanic to a table where the "PClass" column is relabeled to "Class", and the columns "passengerID", "ticket", and "cabin" are dropped.

In [4]:
titanic = titanic.relabeled('Pclass','Class').drop('PassengerId','Ticket','Cabin') #SOLUTION
titanic

Survived | Class | Name                                                | Sex    | Age  | SibSp | ParCh | Fare    | Embarked
0        | 3     | Braund, Mr. Owen Harris                             | male   | 22   | 1     | 0     | 7.25    | S
1        | 1     | Cumings, Mrs. John Bradley (Florence Briggs Thayer) | female | 38   | 1     | 0     | 71.2833 | C
1        | 3     | Heikkinen, Miss. Laina                              | female | 26   | 0     | 0     | 7.925   | S
1        | 1     | Futrelle, Mrs. Jacques Heath (Lily May Peel)        | female | 35   | 1     | 0     | 53.1    | S
0        | 3     | Allen, Mr. William Henry                            | male   | 35   | 0     | 0     | 8.05    | S
0        | 1     | McCarthy, Mr. Timothy J                             | male   | 54   | 0     | 0     | 51.8625 | S
0        | 3     | Palsson, Master. Gosta Leonard                      | male   | 2    | 3     | 1     | 21.075  | S
1        | 3     | Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)   | female | 27   | 0     | 2     | 11.1333 | S
1        | 2     | Nasser, Mrs. Nicholas (Adele Achem)                 | female | 14   | 1     | 0     | 30.0708 | C
1        | 3     | Sandstrom, Miss. Marguerite Rut                     | female | 4    | 1     | 1     | 16.7    | S
... (695 rows omitted)

#2. Let's keep changing our table! The columns 'SibSp' and 'ParCh' seem to reflect similar meanings... Assign the sum of the values of these two columns into the variable family. Add family to the table as the column 'Family', then remove the columns 'SipSp' and 'ParCh'.

In [5]:
family = titanic.column('SibSp') + titanic.column('ParCh') #SOLUTION
titanic = titanic.with_column('Family', family).drop('SibSp', 'ParCh')
titanic

Survived | Class | Name                                                | Sex    | Age  | Fare    | Embarked | Family
0        | 3     | Braund, Mr. Owen Harris                             | male   | 22   | 7.25    | S        | 1
1        | 1     | Cumings, Mrs. John Bradley (Florence Briggs Thayer) | female | 38   | 71.2833 | C        | 1
1        | 3     | Heikkinen, Miss. Laina                              | female | 26   | 7.925   | S        | 0
1        | 1     | Futrelle, Mrs. Jacques Heath (Lily May Peel)        | female | 35   | 53.1    | S        | 1
0        | 3     | Allen, Mr. William Henry                            | male   | 35   | 8.05    | S        | 0
0        | 1     | McCarthy, Mr. Timothy J                             | male   | 54   | 51.8625 | S        | 0
0        | 3     | Palsson, Master. Gosta Leonard                      | male   | 2    | 21.075  | S        | 4
1        | 3     | Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)   | female | 27   | 11.1333 | S        | 2
1        | 2     | Nasser, Mrs. Nicholas (Adele Achem)                 | female | 14   | 30.0708 | C        | 1
1        | 3     | Sandstrom, Miss. Marguerite Rut                     | female | 4    | 16.7    | S        | 2
... (695 rows omitted)

#3. How many family members did passengers have on board on average? Assign this value to avg_family.

In [6]:
avg_family = np.mean(titanic.column('Family')) #SOLUTION
avg_family

0.93475177304964541

#4. Were there possibly more men than women, or vice versa? Find the proportion of passengers that are female.

In [7]:
f_passengers = (titanic.where('Sex', 'female').num_rows)/(titanic.num_rows) #SOLUTION
f_passengers

0.3546099290780142

#5. How many children died? Find the proportion of passengers that are less than 18 years old and did not survive.

In [8]:
prop_child_death = (titanic.where('Age', are.below(18)).where('Survived', 0).num_rows)/(titanic.num_rows) #SOLUTION
prop_child_death

0.08226950354609928

#6. Who were the oldest passengers? What about that couple in the movie??? Assign the name oldest to a table containing the 10 oldest passengers on the Titanic, in order from the oldest to the youngest. Do not drop any columns.

In [9]:
oldest = titanic.sort('Age', descending=True).take(np.arange(11)) #SOLUTION
oldest

Survived | Class | Name                                              | Sex    | Age  | Fare    | Embarked | Family
1        | 1     | Longley, Miss. Gretchen Fiske                     | female | 80   | 77.9583 | S        | 0
0        | 2     | Harper, Rev. John                                 | male   | 74   | 33      | S        | 1
0        | 1     | Artagaveytia, Mr. Ramon                           | male   | 71   | 49.5042 | C        | 0
0        | 1     | Goldschmidt, Mr. George B                         | male   | 71   | 34.6542 | C        | 0
0        | 3     | Connors, Mr. Patrick                              | male   | 70.5 | 7.75    | Q        | 0
1        | 1     | Ryerson, Miss. Susan Parker "Suzette"             | female | 70   | 262.375 | C        | 4
1        | 1     | Taylor, Mrs. Elmer Zebley (Juliet Cummins Wright) | female | 70   | 52      | S        | 1
0        | 2     | Wheadon, Mr. Edward H                             | male   | 66   | 10.5    | S        | 0
0        | 1     | Millet, Mr. Francis Davis                         | male   | 65   | 26.55   | S        | 0
0        | 3     | Duane, Mr. Frank                                  | male   | 65   | 7.75    | Q        | 0
... (1 rows omitted)

<a id="ex2"></a>
## Part 2

#7. Is there an association between the number of family passengers had with them and survival? Assign the name to a survival_w_family table with two columns and two rows: the first column should contain the values '0' and '1', for the passengers' survival, and the second should contain the average number of family aboard the ship for these two groups of passengers. Make a bar chart of this table.

In [10]:
survival_w_family = titanic.group('Survived', np.mean).select('Survived','Family mean') #SOLUTION
survival_w_family

Survived | Family mean
0        | 0.873832
1        | 1.02888

#8. Suppose we want to figure out if passengers of a specific ticket class had a higher chance of survival than passengers of the other ticket classes. To calculate survival rate by class, we first need to find the number of passengers that survived in each class. Construct a two-column table `survivors_by_class` that describes the number of survivors by class.

In [11]:
survivors_by_class = titanic.where('Survived', 1).group('Class') #SOLUTION
survivors_by_class

Class | count
1     | 112
2     | 80
3     | 85

#9. To calculate survival rate, we also need to find the total number of passengers in each class. Assign `total_by_class` to a two-column table that describes the total number of passengers in each class.

In [12]:
total_by_class = titanic.group('Class') #SOLUTION
total_by_class

Class | count
1     | 177
2     | 168
3     | 360

#10. Now we can calculate survival rate by class. Use `total_by_class` to construct a two-column table `class_survival_rates` that contains the different classes in a column labeled `Class` and their corresponding survival rates in a column labeled `Survival Rate`.

It may be helpful to first calculate the survival rates.

In [13]:
survival_rates = survivors_by_class.column('count') / total_by_class.column('count') #SOLUTION
class_survival_rates = total_by_class.drop('count').with_column('Survival Rate', survival_rates)
class_survival_rates

Class | Survival Rate
1     | 0.632768
2     | 0.47619
3     | 0.236111

#11. Suppose that instead of rates, we wanted to see the **number** of survivors and non-survivors by class in the same table. Create a table with three columns and 6 rows, one for each combination of class/survival. *Hint: Table.group can take an array of column labels to group by multiple columns*

In [14]:
class_vs_survival = titanic.group(['Class', 'Survived']) #SOLUTION
class_vs_survival

Class | Survived | count
1     | 0        | 65
1     | 1        | 112
2     | 0        | 88
2     | 1        | 80
3     | 0        | 275
3     | 1        | 85

#12. Another way to visualize this data is using the `.pivot` method. Construct a table that represents the number of survivors and non-survivors by class using `.pivot` with the class labels on the horizontal axis.

In [15]:
class_vs_survival2 = titanic.pivot('Class', 'Survived') #SOLUTION
class_vs_survival2

Survived | 1    | 2    | 3
0        | 65   | 88   | 275
1        | 112  | 80   | 85

#13. LAST QUESTION! We've learned something about class and survival rate. But what about sex? What about class AND sex, together? 

Let's use pivot again to try to answer these. Create a table that groups by class and sex, with the classes as the column labels. Each cell representing a 'combination' of class/sex should contain the proportion of survivors for each combination of class/sex. (Hint: before, we found the survival rate, or proportion of survivors, by finding the number of survivors and dividing by the total number per group. There's another way to do this by using 'Survived' and one function.)

In [16]:
class_sex_survival = titanic.pivot('Class','Sex', 'Survived', np.mean) #SOLUTION
class_sex_survival

Sex    | 1        | 2        | 3
female | 0.962025 | 0.916667 | 0.454545
male   | 0.367347 | 0.145833 | 0.153257